## Hierarchical Indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(np.random.rand(9), 
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1,2,3,1,3,1,2,2,3]])

In [3]:
data

a  1    0.994113
   2    0.710086
   3    0.930870
b  1    0.273502
   3    0.075995
c  1    0.304279
   2    0.293532
d  2    0.003846
   3    0.989922
dtype: float64

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
data['b']

1    0.273502
3    0.075995
dtype: float64

In [6]:
data['b':'c']                #partial indexing

b  1    0.273502
   3    0.075995
c  1    0.304279
   2    0.293532
dtype: float64

In [7]:
data.loc[['b', 'd']]           #partial indexing

b  1    0.273502
   3    0.075995
d  2    0.003846
   3    0.989922
dtype: float64

In [8]:
data.loc[:,2]

a    0.710086
c    0.293532
d    0.003846
dtype: float64

In [9]:
data.unstack()  #you can rearrange the data into a DataFrame using unstack method

          1         2         3
a  0.994113  0.710086  0.930870
b  0.273502       NaN  0.075995
c  0.304279  0.293532       NaN
d       NaN  0.003846  0.989922

In [10]:
data.unstack().stack()

a  1    0.994113
   2    0.710086
   3    0.930870
b  1    0.273502
   3    0.075995
c  1    0.304279
   2    0.293532
d  2    0.003846
   3    0.989922
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a', 'a', 'b', 'b'],[1,2,1,2]],
                    columns=[['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']])

In [12]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ['key1', 'key2']

In [14]:
frame.columns.names = ['state', 'color']

In [16]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [17]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [23]:
frame.iloc[[1]]

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    2        3   4        5

In [24]:
frame.loc[['a']]

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5

### Reordering and Sorting Levels

In [27]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [28]:
frame.sort_index(level=1)    #sort_index, sorts the data using only the values in a single level

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [29]:
frame.swaplevel(0,1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

In [30]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [33]:
frame.sum(level='color', axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

In [38]:
frame = pd.DataFrame({'a': range(7), 'b': range(14, 0, -2),
....: 'c': ['one', 'one', 'one', 'two', 'two',
....: 'two', 'two'],
....: 'd': [0, 1, 2, 0, 1, 2, 3]})

In [39]:
frame

   a   b    c  d
0  0  14  one  0
1  1  12  one  1
2  2  10  one  2
3  3   8  two  0
4  4   6  two  1
5  5   4  two  2
6  6   2  two  3

In [40]:
frame2 = frame.set_index(['c', 'd'])
#set_index function will create a new DataFrame using one or more of its columns as the index

In [41]:
frame2

       a   b
c   d
one 0  0  14
    1  1  12
    2  2  10
two 0  3   8
    1  4   6
    2  5   4
    3  6   2

In [42]:
frame.set_index(['c', 'd'], drop= False)

       a   b    c  d
c   d
one 0  0  14  one  0
    1  1  12  one  1
    2  2  10  one  2
two 0  3   8  two  0
    1  4   6  two  1
    2  5   4  two  2
    3  6   2  two  3

In [44]:
#reset_index, does the opposite of set_index; the hierarchical index levels are moved into the columns:
frame2.reset_index()

     c  d  a   b
0  one  0  0  14
1  one  1  1  12
2  one  2  2  10
3  two  0  3   8
4  two  1  4   6
5  two  2  5   4
6  two  3  6   2

## Combining and Merging DataSets